0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    leftWall
    {
        type nutkWallFunction;
        value uniform 1e-5;
    }

    rightWall
    {
        type nutkWallFunction;
        value uniform 1e-5;
    }

    leftBottom
    {
        type nutkWallFunction;
        value uniform 1e-5;
    }

    middleBottom
    {
        type nutkWallFunction;
        value uniform 1e-5;
    }

    rightBottom
    {
        type nutkWallFunction;
        value uniform 1e-5;
    }

    ceiling
    {
        type nutkWallFunction;
        value uniform 1e-5;
    }

    frontAndBack
    {
        type empty;
    }
}
