0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1;//0.001;  // Estimated initial value

boundaryField
{
    leftWall
    {
        type omegaWallFunction;
        value uniform 1;//0.0001;
    }

    rightWall
    {
        type omegaWallFunction;
        value uniform 1;//0.0001;
    }

    leftBottom
    {
        type omegaWallFunction;
        value uniform 1;//0.0001;
    }

    middleBottom
    {
        type fixedValue;
        value uniform 1;//0.0001;
    }

    rightBottom
    {
        type omegaWallFunction;
        value uniform 1;//0.0001;
    }

    ceiling
    {
        type omegaWallFunction;
        value uniform 1;//0.0001;
//        type inletOutlet;
//       inletValue uniform 0;
//        value uniform 0;
    }

    frontAndBack
    {
        type empty;
    }
}

