0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;  // Initial total pressure (usually atmospheric)

boundaryField
{
    leftWall
    {
        type calculated;
        value uniform 1e5;
    }

    rightWall
    {
        type calculated;
        value uniform 1e5;
    }

    leftBottom
    {
        type calculated;
        value uniform 1e5;
    }

    middleBottom
    {
        type calculated;
        value uniform 1e5;
    }

    rightBottom
    {
        type calculated;
        value uniform 1e5;
    }

    ceiling
    {
        type calculated;
        value uniform 1e5;
    }

    frontAndBack
    {
        type empty;
    }
}
