system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


scale 1;

vertices
(
    (0 0 0)         // 0 - Bottom left
    (2 0 0)       // 1 - Left boundary of middle region
    (3 0 0)   // 2 - Right boundary of middle region
    (5 0 0)       // 3 - Bottom right
    (5 5 0)      // 4 - Top right
    (0 5 0)        // 5 - Top left
    (0 0 0.01)        // 6 - Bottom left (Top layer)
    (2 0 0.01)      // 7 - Left boundary of middle region (Top layer)
    (3 0 0.01)  // 8 - Right boundary of middle region (Top layer)
    (5 0 0.01)      // 9 - Bottom right (Top layer)
    (5 5 0.01)     // 10 - Top right (Top layer)
    (0 5 0.01)       // 11 - Top left (Top layer)
    (2 5 0)  
    (3 5 0) 
    (3 5 0.01)
    (2 5 0.01) 
);

blocks
(
    hex (0 1 12 5 6 7 15 11) (60 120 1) simpleGrading (1 1 1)  // Left block
    hex (1 2 13 12 7 8 14 15) (30 120 1) simpleGrading (1 1 1)  // Middle block (Initial temperature)
    hex (2 3 4 13 8 9 10 14) (60 120 1) simpleGrading (1 1 1)  // Right block
  
 //hex (5 12 15 11 0 1 7 6) (40 1 80) simpleGrading (1 1 1)  // Left block
   // hex (12 13 14 15 1 2 8 7) (20 1 80) simpleGrading (1 1 1)  // Middle block (Initial temperature)
    //hex (13 4 10 14 2 3 9 8) (40 1 80) simpleGrading (1 1 1)  // Right block
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 5 11 6)  // Left vertical face
        );
    }

    rightWall
    {
        type wall;
        faces
        (
            (3 4 10 9)  // Right vertical face
        );
    }

    leftBottom
    {
        type wall;
        faces
        (
            (0 1 7 6)  // Bottom left region
        );
    }

    middleBottom
    {
        type wall;
        faces
        (
            (1 2 8 7)  // Bottom middle region (Initial temperature)
        );
    }

    rightBottom
    {
        type wall;
        faces
        (
            (2 3 9 8)  // Bottom right region
        );
    }

    ceiling
    {
        type wall;
        faces
        (
            (5 12 15 11)  // Top boundary
            (12 13 14 15)
	    (13 4 10 14)
	);
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 7 6) 
	    (1 2 8 7)
	    (2 3 8 9)  // Front face
            (5 12 15 11)
	    (12 13 14 15)
	    (13 4 10 14) // Back face
        );
    }
);
mergePatchPairs () ;
